{
    "tags":[
        {
            "type":"text",
            "text":"Этот урок посвящён добавлению предметов в Mindustry."
        },
        {
            "type":"text",
            "text":"Сначала создайте новый класс, который будет содержать модифицированные предметы:"
        },
        {
            "type":"image",
            "link":"1.PNG"
        },
        {
        	"type":"text",
        	"text":"Затем создайте поле класса Item и инициализируйте его в методе load как показано на картинке:"
        },
        {
            "type":"image",
            "link":"2.PNG"
        },
        {
        	"type":"text",
        	"text":"Объяснение:"
        },
        {
        	"type":"text",
        	"text":"Вы вызываете конструктор класса Item и передаёте ему два аргумента: String name, Color color"
        },
        {
        	"type":"text",
        	"text":"Перед пояснением полей класса Item Вам понадобится создать текстуру предмета. Она должна представлять собой .png файл с разрешением 16x16. Она должна быть помещена в assets/sprites/items и названа так же как и фргумент name, переданный Вами конструктору ранее:"
        },
        {
            "type":"image",
            "link":"3.PNG"
        },
        {
        	"type":"text",
        	"text":"Теперь об атрибутах предмета."
        },
        {
        	"type":"text",
        	"text":"int hardness - твёрдость предмета."
        },
        {
        	"type":"text",
        	"text":"float cost - начальная стоимость материала. Используется для расчёта времени строительства сооружения: 1 cost = 1 tick."
        },
        {
        	"type":"text",
        	"text":"boolean lowPriority - если правда, то у данного предмета наименьший приоритет для буров."
        },
        {
        	"type":"text",
        	"text":"boolean buildable - если правда, то этот предмет используется в строительстве, иначе он будет сожжён в некоторых ядрах."
        },
        {
        	"type":"text",
        	"text":"float explosiveness - насколько взрывоопасен этот предмет."
        },
        {
        	"type":"text",
        	"text":"float flammability - воспламеняемость. Если выше 0.3, то данный предмет может быть использован в качестве топлива."
        },
        {
        	"type":"text",
        	"text":"float charge - насколько сильно этот предмет заряжен."
        },
        {
        	"type":"text",
        	"text":"float healthScaling - когда этот предмет включен в стоимость блока, его здоровье умножено на 1 + scaling, где 'scaling' суммируется со всеми требуемыми предметами."
        },
        {
        	"type":"text",
        	"text":"boolean alwaysUnlocked - если правда, то данный предмет всегда доступен."
        },
       	{
        	"type":"text",
        	"text":"Здесь были представлены все атрибуты класса Item Если Вы всё сделали верно, то предмет был добавлен в игру, и Вы увидите что-то вроде этого:"
        },
        {
            "type":"image",
            "link":"4.PNG"
        }
    ]
}
